# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной
# и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть

# coin = int(input('Введите колличество монет: '))
# count_1 = 0
# count_2 = 0
# for i in range(coin):
#     edge = int(input('Сколько монет одной стороной: '))
#     if edge == 0:
#         count_1 += 1
#     else:
#         count_2 += 1
# if count_2>count_1:
#     print(count_1)
# else:
#     print(count_2)
# ////////////////////////////////////////////////////////////////////

# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), 
# а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S 
# и их произведение P. Помогите Кате отгадать задуманные Петей числа.

# x = int(input('Введите первое число: '))
# y = int(input('Введите второе число: '))
# for i in range(x):
#     for j in range(y):
#         if x ==i+j and y==i*j:
#             print(x,j)
# /////////////////////////////////////////////////////////////////////

# Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

n = int(input())
step = []
k = 0
while 2**k<=n:
    step.append(2**k)
    k+=1
    print(step)
